_posts/2015-04-23-maven-jar.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. missing artifact com.oracle:ojdbc14:jar:10.2.0.2.0</a></li>
</ul>
</div>
</div>
---
layout: view_simple
title: Maven jar 包问题汇总
excerpt: excerpt
keywords: keywords
categories: [maven]
tags: [maven]
---

<p>
整理一些maven jar的问题,例如missiong artifact等..
</p>


<!-- more -->


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> missing artifact com.oracle:ojdbc14:jar:10.2.0.2.0</h2>
<div class="outline-text-2" id="text-1">
<p>
下载jar，导入到maven中
</p>

<p>
下载：<a href="http://download.csdn.net/detail/spring123tt/6991897">http://download.csdn.net/detail/spring123tt/6991897</a>
</p>

<p>
cmd中输入：
</p>

<div class="org-src-container">

<pre class="src src-shell">mvn install:install-file -DgroupId=com.oracle -DartifactId=ojdbc14 -Dversion=10.2.0.2.0 -Dpackaging=jar -Dfile=C:\Users\Administrator\Desktop\ojdbc14-10.2.0.2.0.jar
</pre>
</div>

<p>
导入到maven本地库中。重新运行下maven update就OK了。
</p>
</div>
</div>
